[
	{
		"name":"Broken Models",
		"category":"Disappearance",
		"number":"Someone near me was crying. I wished she’d shut up before we all got in trouble. I knew it was too late. I heard the man’s footsteps behind me, making his way over to her. I stared hard at the wall in front of me. I flinched when he hit her. He’d already hit me so many times—the sound was too familiar, the sting on my cheek. So many blows they all began to blend together. Already I was growing numb.\n\nThere were six of us. All girls. Crammed in the back of a U-haul. Four blondes, two red heads—I suppose we were the most desirable—and a man. He was some big burly guy I had never seen before. His job was to keep us in line. Keep us from making any sounds as we drove around. Even bound and gagged I suppose we could have made enough noise to draw attention. Maybe all six of us together could even have taken our lone guard. Maybe even the driver. But I had seen the other girls. I had seen their dull expressions as they forced us into the truck. I had seen their slumped posture. Bruised bodies. Deadened eyes. These girls had given up long ago. Maybe I had too. \n\nIt had started at the mall. It was the first time my parents had let me go just with my friends. Jessica, Madi, and I. I having just turned 16. Jessica and Madi were only slightly older.\n\nThere was a man. Madi saw him first, watching us from across the store. We were browsing earrings in Hot Topic or some other—I don’t remember. 'Look Kayla,' she had said, 'you’ve got yourself a fan-club.' I smirked, though the man made me uneasy. I could feel his piercing gaze, even through his aviators.\n\nHe was a smooth guy, I’ll give him that. I suppose he had to be.\n\n“You’re a very beautiful girl,” he said. Just straight up like that. I should have ran right there. I should have smashed his face in. Madi and Jessica were just a step away. I tried to reach out to them, turn to them for help, he held me back by my elbow. A strong grip, and yet so relaxed in his posture. I should have yelled. Madi was smiling. A cocky smile. It scared me. “Listen,” said the man, “I can hook you up. I can make you famous.” He nodded at the Victoria’s Secret on the other side of the mall. “Wouldn’t you like to be like that.” The front of Victoria’s Secret was plastered with larger than life posters of models. All very beautiful women. “You could be like them. You’re a very beautiful girl.”\n\n“I can’t,” I said. “I have to go.” Madi looked disappointed. Jessica looked at her feet.\n\nMadi moved closer to me. Please save me. “Could I be like them?” Madi asked. I pulled away from the man.\n\nHe smiled. “Yeah,” he said. “Yeah, I think… Actually, why don’t all three of you come with me—I’ll hook you up.” It was a very wide smile. Too calculated.\n\nMadi pushed me to follow the man. “You’re being ridiculous,” she hissed at me. “Didn’t you hear about Katy’s sister? She was discovered at a mall too. Actually, I think it was this mall.”\n\nJessica nodded. It was true after all—I had heard that story repeated many times in school. I thought then that maybe I was being ridiculous. I thought a lot of things.\n\nThe man was leading us to the nearest exit. He told us his coworkers were waiting there. They could get us a contract. It was one of the lesser used exits of the mall. We passed only a few onlookers.\n\nHis coworkers turned out to be men like him. Older than us, but still young enough to be attractive. The fattest of them looked up as we approached. “Let’s go out to the car,” he said. “I’ve got some forms you can look through.”\n\nIt was dark outside. Cold, and quite deserted. I tugged Madi’s arm, but she only scoffed at me. The hell were we getting ourselves into?\n\nThe men asked our ages and seemed uneasy at the responses. One of them said we should have been older, but the one who had “discovered” us silenced him with one word: “Rico.”\n\nI did not know who Rico was then, but I do now. Rico was driving the U-haul with six unwilling passengers. I was staring hard at the wall of the truck. There was nothing else I could do.\n\nWhen the truck stopped and the back thrown open a hoard of burly men jumped aboard. They grabbed us and pulled us into a building—some warehouse, I think. I did not struggle as I had before. None of us did. We were broken.\n\nI don’t know how many days we were kept in the warehouse. There were no windows in the warehouse, only flickering fluorescent lights somewhere far above us. Half of them were dead and had never been replaced. The large open space was divided into steel cages. Like for cattle. I had one all to myself and it was all I knew of my surroundings. I had no idea how big the building was, nor how many of us were trapped there.\n\nThey fed me hardly anything. Just enough white bread with Cheez Whiz to keep me alive. They must have drugged me too, though I don’t remember them actually administering anything, because I started to hallucinate. A lot. On good days I hallucinated my parents. They had come to save me. Or Liam Neeson, though I had never actually seen Taken. I wished I had, maybe it would have taught me something. Probably that I am an idiot. Anyway, I doubt it’s that realistic—it is Hollywood after all. But it doesn’t matter, I’ll never see it.\n\nI was woken up suddenly. A rough hand clamped under my armpits, dragging me to my feet. I could hardly stand, but it’s not like I needed to—the hands dragged me all the way. Another U-haul, but this time I was alone with my guard. Thankfully, he seemed very bored and uninterested in me.\n\nAt the next stop I was given a bath. The hands had to wash me as I could barely do it myself. I can't believe how much grime I was covered in—I think most of it was my own fecal matter. I just didn’t care anymore. I was also given a full meal, tons of makeup, and a set of clothes—some skimpy miniskirt and a tank top. Soon I could think clearly again.\n\nThis time I was given a ride in a car. I don’t know anything about cars, but it was a really nice one. Leather seats and I don’t even know. There was a guard sitting next to me, but he was wearing a suit. A really nice suit. When the car stopped, he jabbed me. “Smile,” He grunted.\n\nI was pulled out of the car and handed over to another man in a hoodie. I guess he had already given them some money. I don’t know how much.\n\nThe new man led me into a house. From the outside, the house was just an ordinary house. It looked no different than any of the other houses on the street. Even the lawn was freshly mowed and the garden was well-tended to. I was led inside and immediately to the basement. There I was tied to a wall and left for a few hours. It was dark in the basement, so I couldn’t see anything, but I could smell and it smelled bad, I can’t even describe it—it was unlike anything I had ever smelled before. Also, the wall I was tied to was quite cold and sticky, but these were the only observations I was able to make.\n\nWhen the man returned, he had with him several more men. They were all hooded, though this time not in sweatshirts. They were actually wearing full length cloaks—like monks or the KKK, except black cloaks. It sounds stupid, but in real life, in the dark basement, it freaked me out quite a bit.\n\nThe monks or Klansman or whatever the hell they were began to move around the room lighting long candles supported on metal stands. As the room slowly began to be illuminated I first could make out that the walls were almost completely covered in shiny red splatters. I suppose that would explain the stickiness. On the floor in front of me were two stone tables. One was quite large and the other rather small. Another hooded man appeared coming down the staircase. He was carrying some animal, which I could soon tell was a goat. The man placed it on the smaller of the stone tables and his associates help him to bind the goat to it with chained shackles. The goat barely struggled during the whole process.\n\nI was observing how perfectly designed the small table was that the goat fit perfectly within the grooves and shackles, when I realized the larger table was meant for a human. In other words, me.\n\nBut whatever ritual or whatever the men were preforming started with me still chained to the wall. The men drew pentagrams on the floor, set things on fire, and chanted in languages I didn’t recognize. The room grew smoky fast and I began to fade back into my usual hallucinations, but just before I went out completely I made out one of the men raising a dagger high in the air. After a moment he brought it down swiftly in such a way that blood splattered the walls once more. The goat was gone and I, mysteriously, was still alive.\n\nWhen I came to, the basement was dark again. From what I could tell the basement had been cleared out of all animal carcasses, pentagrams, and other humans. I was to stay tied to the wall for a few more days. The man who had bought me fed me every couple of hours, but other than that I was left alone. He rarely talked but I was able to learn from him that his friends had decided I was not ready yet. I was also pretty sure he was trying to fatten me up. Obviously, his plans for me were very different from those who had held me before. \n\nOne day (or night—I couldn’t tell) I could hear a lot of commotion upstairs. I knew this was it. I was so far gone I didn’t care anymore. It was simply a fact of life. However, when someone finally came down the stairs he was not wearing a cloak, nor was he carrying a goat. He was carrying a large black flashlight and wearing a police officer’s uniform. Another hallucination of mine, I knew it. \n\n'Hello?' said the hallucination. 'Anyone down here?'"
	},
	{
		"name":"Dead Air",
		"category":"Disappearance",
		"number": "I was pulled from a dead sleep by a dull thud. Sitting up in my bed, I looked at the clock and realized I had slept in, the red numbers read just after one in the afternoon. I lay back down and closed my eyes, waking my body up with a stretch. I lay there for a moment and heard the thump again, recognizing it as a knock on the door.\n\nMy dog started to bark outside in the back yard as I pulled myself out of bed and grabbed clothes. The knock sounded again. 'One second!' I called. I pulled on my shirt and shorts and went out to see who it was. I peeked through the little peephole in the door, having to stand on my toes to see. An elderly woman stood there for a moment before she knocked again, making me jump. I unlocked the door and opened it. She smiled, but despite the fact that she had a kind look about her, I couldn't help but feel that something wasn't right. The woman looked odd, she had thick, tangled black and grey hair, wrinkly tan skin, and wore clothes like she had been in them for a while, they were faded and she had a smell that came off her that made my stomach turn. When she smiled, I could see she was missing some teeth, and what teeth she had were yellowed and rotting. I tried hard to remain polite, though the smell of her was starting to make me feel sick. She then tried to give me a small, old, tattered-looking yellowed card.\n\n'Se puede llamar a este número, por favor?' she questioned. I stood there like an idiot for a second, not knowing what she had said. I didn't speak Spanish very well, aside from asking if they spoke English, or saying that I didn't understand Spanish. She gave me a small smile before she took the card and pointed at the number on the bottom. I nodded and went to get my phone.\n\nOn the card, an old cab number as well as a picture of a cab, worn as the rest of the card, stared back at me as I looked at the number. I punched in the numbers on the phone and waited. It had been just a second before the dial tone gave way to dead air and static. I stood still, my stomach sinking to my feet. I looked at the card again and shut off the phone. I read the number again and, again, dialed it into the phone to be sure that I had entered the right number. Same result. Confused, I turned to the woman, my face paling. She was gone. I hadn't even heard her leave. I stuck my head out the door, then went onto the porch and looked around. My dog had stopped barking in the back, so she couldn't have gone around that way.\n\nThe ground was littered with fallen leaves, I would have heard her footsteps, but I hadn't heard anything. Thoroughly confused, I slipped my feet into my shoes and went outside, still holding my phone and the old card, and went to check the back. The dog was playing with his ball, chewing mercilessly at the old baseball before looking up at me with a wag of his tail. I watched him a moment before I went back to the front of the house, then checked around the other side. The old woman was nowhere in sight.\n\nWith shaking hands, I went back into the house, put the phone back on the cradle, and looked at the card. I flipped it over in my hands, looking for a date somewhere on the card, but found none. The slip of paper gave me a feeling of unease. Without hesitation, I took the card and burned it. Since this incident, I've heard knocks on my door, but when I would go to see who it was, they were gone. Sometimes, the phone will ring and when I answer, the number is unknown and there is nothing but dead air and static."
	},
	{
		"name":"The Dare",
		"category":"Disappearance",
		"number":"It was a dare for the record books. Anyone who took it was labeled clinically insane by their friends, and would have to be carted away to the loony bin.\n\nBut if anyone was insane that day, it was Thomas Schwartz (known as Tommy to his friends). He not only volunteered to do it, but he was going to do it alone.\n\nStanding in the driveway of the Neveserian house, he stood confident. His eyes shifted from window to door, seeking out weaknesses.\n\nIf he was scared, he didn’t show it. Ignoring the cheers of his accomplices, he advanced towards his opponent. The sounds of a lawnmower hitch a ride with the breeze, engulfing the children as they hold position.\n\nThe driveway found itself losing a war with the grass, and the boundary where they separated became unclear. Tommy didn’t notice this; his mind was focused upon his goal, and what lay ahead. Cicadas argued with each other while the birds sang the aria of summer, but all of this was lost on Thomas as the wood steps underneath his feet moaned with the effort from supporting him.\n\nWith the doorbell non-functioning, and no welcome mat to accommodate him, Tommy pried open the screen door (who also had some complaining to do), and reached for the brass knob. As his thumb began pushing down the lever, time held its breath in anticipation.\n\nHis friends had long ceased their cheers, and merely stood where it was safe, letting the sun extract sweat from their pores. Even the birds and the cicadas had paused in their conversation to study him. The door wailed as it allowed him entry, and again when the house had engulfed him.\n\nWith the door in-between his friends and him, the fear crept into his face. The path to being a schoolyard legend certainly isn’t the easiest. Nothing had shambled into sight clanking chains, though that didn’t alleviate Thomas’s fears. His goal resided on the second story, and the faster he made it there, the less likely he would end up being killed by horrors unknown.\n\nWith every fiber of his being resisting him, Thomas advanced through the house. The echo of his footfall seemed to resonate throughout the entire house as they collided with the carpet which had cushioned the heads of the three families that lived there.\n\nUpon passing the foyer, white sheeted figures assaulted his vision, making him leap. However, the furniture did not attack, perhaps not hungry for small children. As his heart safely descended from his throat, Thomas had reinforced his nerves, and began walking again.\n\nThe stairs curved at a sharp turn near the middle. A small groan issued from Thomas as nightmarish scenarios played out in his mind. The fact that this particular staircase was used as a bowling alley for severed heads didn’t exactly appeal to him either."
	},
	{
		"name":"Erics Mirror",
		"category":"Disappearance",
		"number":"It was a dare for the record books. Anyone who took it was labeled clinically insane by their friends, and would have to be carted away to the loony bin.\n\nBut if anyone was insane that day, it was Thomas Schwartz (known as Tommy to his friends). He not only volunteered to do it, but he was going to do it alone.\n\nStanding in the driveway of the Neveserian house, he stood confident. His eyes shifted from window to door, seeking out weaknesses.\n\nIf he was scared, he didn’t show it. Ignoring the cheers of his accomplices, he advanced towards his opponent. The sounds of a lawnmower hitch a ride with the breeze, engulfing the children as they hold position.\n\nThe driveway found itself losing a war with the grass, and the boundary where they separated became unclear. Tommy didn’t notice this; his mind was focused upon his goal, and what lay ahead. Cicadas argued with each other while the birds sang the aria of summer, but all of this was lost on Thomas as the wood steps underneath his feet moaned with the effort from supporting him.\n\nWith the doorbell non-functioning, and no welcome mat to accommodate him, Tommy pried open the screen door (who also had some complaining to do), and reached for the brass knob. As his thumb began pushing down the lever, time held its breath in anticipation.\n\nHis friends had long ceased their cheers, and merely stood where it was safe, letting the sun extract sweat from their pores. Even the birds and the cicadas had paused in their conversation to study him. The door wailed as it allowed him entry, and again when the house had engulfed him.\n\nWith the door in-between his friends and him, the fear crept into his face. The path to being a schoolyard legend certainly isn’t the easiest. Nothing had shambled into sight clanking chains, though that didn’t alleviate Thomas’s fears. His goal resided on the second story, and the faster he made it there, the less likely he would end up being killed by horrors unknown.\n\nWith every fiber of his being resisting him, Thomas advanced through the house. The echo of his footfall seemed to resonate throughout the entire house as they collided with the carpet which had cushioned the heads of the three families that lived there.\n\nUpon passing the foyer, white sheeted figures assaulted his vision, making him leap. However, the furniture did not attack, perhaps not hungry for small children. As his heart safely descended from his throat, Thomas had reinforced his nerves, and began walking again.\n\nThe stairs curved at a sharp turn near the middle. A small groan issued from Thomas as nightmarish scenarios played out in his mind. The fact that this particular staircase was used as a bowling alley for severed heads didn’t exactly appeal to him either."
	},
	{
		"name":"Mount Pleasant",
		"category":"Disappearance",
		"number":"Mount Pleasant is one of those little suburban communities that seem to have spilled out across the rural Ontario countryside in recent years. Like many of its breed, it contains an endless procession of tidy, reasonably sized houses neatly lined up by the sides of streets with names like Sunnyview Road, Grovewood Drive, and Orange Tree Gate. Even the name of the community itself is unspectacular. As a matter of fact, there are eight different 'Mount Pleasants' in Ontario alone.\n\nHowever, on the morning of March 12, 2008, some of its residents awoke to a bewildering surprise. Alongside a small, sleepy road called Emmett's Circle, there appeared to be one more streetlight than had illuminated the road the night before. The mysterious lamppost stood as tall and weather-worn as its neighbors. Even the snow around it seemed undisturbed. Although, curious locals who drew near enough reported hearing a faint, directionless humming when in close proximity to it.\n\nInquiring calls were placed to the local Municipality Offices, but all were responded to in befuddled tones. It appeared no one had ordered the unusual nighttime installment. The world continued to turn though, and the sun set on March 12, leaving those who had witnessed the oddity with no more information than they had had at the beginning of the day. March 13 only brought more mystery. There lay only undisturbed, virgin snow where the perplexing lamppost had stood the evening before.\n\nMedia and the government workers who had been called down to inspect the peculiarity found nothing, and any investigation ceased, written off for the most part as an elaborate community gag. In the days that followed, another strange occurrence gradually surfaced.\n\nPleading signs and posters began to coat any accommodating surface of the streets. Nearly 15 outdoor cats and dogs, kept as pets in a surrounding radius of about two kilometers, were reported missing in the following week.\n\nMany of them were last seen sometime between the 11th and the 13th."
	},
	{
		"name":"Sleepover",
		"category":"Disappearance",
		"number":"A young girl had a sleepover with several of her teenage friends attending. Shortly before midnight, she told her guests that there was a grave at the edge of the woods behind her house and anyone going there on a full moon and standing too close to the grave would be pulled into the grave by the bony hand of the old man buried there.\n\nOne fifteen-year-old girl scoffed at the story, and after much teasing, accepted the challenge of going alone to the grave. As proof she had actually gone all the way she was to stick a large pitchfork into the top of the grave for inspection by all the others the next morning.\n\nThe girl left and did not return. The others got scared (and afraid to wake the adults in the house) fearful that they'd be in serious trouble. They stayed in the girl's room for hours, until they were certain they had to do something.\n\nEarly the next morning, they all huddled together and nervously made their way to the grave. There they found their friend, lying dead from exposure, beside the grave with her long night gown pinned to the grave where she had stuck the fork through it and into the hard clay covering the grave."
	},
	{
		"name":"A Childhood Memory",
		"category":"Creature",
		"number":"When I was a kid, I would visit my Uncle Nathan every month or so. He lived in the middle of the woods in Washington, in this big aging Victorian house. I still remember driving up there the first time, seeing the tall spire, its shadow seeming to envelop us as it approached. Nathan wasn't much older than my dad, whom was in his late 30s, but he certainly looked older. He'd traveled all across the world and, much to my delight, he'd often regale me with stories about his time abroad. He'd talk about how he camped on the African Sahara or how he'd sailed through the Arctic Circle.\n\nHe was a bit eccentric, yes, but my Uncle was one of the finest men I knew. He was the kind of person who'd give you the last dollar he had, even if it meant he had to go hungry. He always talked about the people he met or the culture he experienced, often times while we fished for cod in the nearby river. Nathan would always talk about that old phrase 'walk a mile in another man's shoes' and how I should always see both perspectives. He was a good man and, even today, I respect him infinitely.\n\nThere is one night, though, that stands out in my memory of him. I was eight at the time and the two of us had just finished working on Nathan's old jeep. The sun was just about out of sight, peeking over the mountains and casting an orange hue across the sky. Nathan sent me to bed, since we needed to be up early the next day. He hoped we could squeeze some fishing in before I had to go home. As I pulled the covers up, I heard a small clattering outside. I was curious, so I hopped out of bed and crept downstairs. The drapes were pulled back, allowing me to see Nathan, sitting on the edge of the porch. He seemed sullen, breathing heavily as he scanned the tree line. It was then that I noticed the shotgun in his right hand, cold steel shimmering in the sunset light. A small plastic bucket sat on his left, filled with some kind of indescribable red sludge.\n\nI looked around the small clearing, noting its various landmarks. The jeep, the large rock near the trees that Nathan let me climb, even mountains in the distance. One thing that caught my eye was the shed, just off the right of the house. It was a shabbily built mess that Nathan had always kept locked and bolted tight with several chains. He'd forbid me from going inside, saying that it was filled with equipment and I could get hurt. I only remembered this because it was one of the few times Nathan had been stern with me.\n\nNow, the shed was wide open and I could barely see the glint of metal in the darkness. The sun had finally disappeared, casting darkness across us. Nathan checked his watch and started looking around. A rustling in the bushes caught our attention; Nathan's grip on the shotgun tightened. A white form emerged from the woods, straddling across the clearing like a wounded deer. It had to have been seven feet tall, its limbs stretching and morphing as it moved. Its body was deathly white, composed of some amorphous substance not unlike gelatin. Human-like eyes peppered its form, moving to and fro in a bizarre frenzy until eventually settling on Nathan. A set of teeth, partly human and partly animal, emerged from the creature. Its head, if it could be described as such, looked down upon him. Saliva dripped from its mouth as Nathan placed the bucket before the beast.\n\nIt looked at it for a moment before another head emerged from it, diving into the bucket and consuming the fluid with a loud slurp. The creature continued to stand before Nathan, almost as though it were waiting. I heard Nathan speak:\n\n'Well, what are you waiting for? Get the hell out of here.'\n\nThe creature continued to stare.\n\n'I told you before, I'm running out of options here! You think it's easy finding shit you'll eat? I had to put down a dog for that, you fuck!'\n\nIts grotesque, pearly white teeth shone brightly in the waning sunlight. They curled into a frown as the creatures eyes focused on Nathan. It edged closer towards Nathan, whose form seemed so much smaller than the beast now. I could see his hands tremble as he raised the shotgun on the creature, the safety disengaging with a loud click. Nathan spoke, his voice cracking.\n\n'Get the fuck out of here!'\n\nThe beast reeled at his defiance, its many eyes piercing into him. The mouths covering its body all morphed into angry snarls. It head snaked from its body and sat inches from Nathan's face. It was so close I could see the organs and limbs forming beneath its disgusting pale translucent skin. Lungs and kidneys floated about, connecting and disconnecting with other organs. Then, it just turned and left. I watched its pale form gesticulate and morph as it disappeared into the bushes.\n\nNathan stood there for a moment. He stared into the distance like a statue, the wind blowing through the clearing in a shrieking crescendo. I watched him collapse onto the porch, head between his hands as he wept. I moved away from the window, unsure of what to think. I crept back upstairs and crawled into bed. As I stared at the ceiling that I became aware of a light scratching on the window.\n\nI turned and immediately froze. There it was, the creature, staring directly at me. Its cancerous form was planted firmly against the window, a single arm protruding outwards and scraping the glass. I wanted to scream, but it felt as though every muscle in my body had locked up. Its mouths all curled into devilish smiles as it stared at me, slime dripping and smearing against the window. My breath caught in my throat as I watched one of its mouths open and an eerily human tongue emerge. The tongue lapped against the window as the beast moaned quietly. I took my attention from its horrifying display just long enough to realize it was edging the window open.\n\nJust as I prepared to slam the window shut, Nathan pounded up the stairs and threw the door open. He eyed the creature, raised the shotgun and fired. Glass and slime flew about the room as I pulled the covers over my head. Another shot resounded whilst I felt my sheets become wet. Suddenly, I was grabbed from the bed and embraced. I screamed, only to realize Nathan was holding me, crying. He'd thrown the gun down and told me he was sorry, that he never should have brought him here. I looked to the window; the beast was gone.\n\nWhen my father picked me up the next day, Nathan took him aside and whispered something to him. My father never told me what he said, even on his deathbed. I never went back to Nathan's home, either. I went on with my life; I moved out, got a girlfriend, started going to college. I never even really thought much of my experience. I figured it was some kind of bizarre night terror. However, one day I was with my mother for a family gathering and the topic of my Uncle came up. When I asked her about him, she unceremoniously told me he'd died. When I pressed her about it later, she said that he'd died under bizarre circumstances about a year after my last visit. Curious, I decided to investigate further.\n\nI checked into the local police station and managed to sweet talk the receptionist into letting me look over the files. What I found was...odd. The report stated that the house showed signs of forced entry, yet Nathan had apparently died of a self-inflicted shotgun wound. I couldn't find much about his death beyond that, so I decided to go directly to the source. I went to the house. The road was completely decrepit, huge rocks and bushes forcing me to abandon the car and hike the rest of the way. The house was equally destroyed; graffiti and peeling paint coating its monolithic walls. I broke open the door and poked around for a few hours. I still found nothing, apart from an insane amount of cobwebs and dust.\n\nThen, whilst searching Nathan's room, I tripped over a loose board. I caught myself, thankfully, and turned back to pry open the board. The space beneath with filled with piles of rotting paper. I rummaged through the mess and found a small, leather-bound book. It was almost like a scrapbook, but it contained a fairly large amount of newspaper clippings, most of them dated to after my last stay with Nathan. They were all about missing children. The kids had disappeared from the surrounding towns. Someone or something had gone into their homes and spirited them away during the night. The papers reported that there were no real clues, only that small amounts of clear slime were found in the children's rooms.\n\nI was unnerved, to say the least. I quickly grabbed my things and left the building. The sun had just fallen behind the tree line, bathing the open space in front of the house in amber light. Just as I started to head back towards the car, I spotted something moving in the bushes. I thought it might be a coyote or a mountain lion, but a cold chill rang down my spine when I got a better look at it.\n\nAn enormous creature, probably about eight feet tall, had stumbled out from behind the brush. Its limbs splayed about like a spider, it dragged itself out onto the barren field. Then, a worm-like head emerged from it and turned towards me, a pair of pearl-white teeth curling into a vicious smile. As I looked over the rest of its body, I saw that the creature was attached to the end of a huge, tentacle like appendage that trailed deep into the woods. I could see something beneath its translucent skin, something eerily human. I try to tell myself it wasn't moving. I try to forget the muffled screams.\n\nThe two of us stood there, staring one another down. I finally broke from my paralysis and ran down the trail, almost tripping and braining myself along the way. I couldn't tell if it was following me, but I wasn't keen on finding out. I eventually made it back to the car and drove home. Once I pulled into the driveway, I just collapsed against the wheel and started crying. For about a week, I couldn't go outside. I was a complete wreck; I couldn't stand the idea of going the same way Nathan did. I considered calling the cops, but I knew they'd just think I was insane. I can't go in the forest anymore, and even when I'm near one, I can't shake the sense that I'm being watched. I'm still not really sure what I encountered, nor do I have any intention of ever finding out. While I've considered the idea of returning to try and kill the creature, I have little doubt I'd suffer the same fate as my Uncle.\n\nThe old Victorian was destroyed, along with half the woodlands, in a massive forest fire. I hoped that maybe the creature had been killed, but then I turned on the news this morning. Three children, stolen from their homes in the night. The police were baffled; no fingerprints, no DNA, nothing. The only thing they could find was translucent slime slathered on the children's windows."
	},
	{
		"name":"Claws on Tile",
		"category":"Creature",
		"number":"I suppose I shouldn’t have been surprised when my wife asked me for a divorce. The stress of juggling work, our marriage and looking after our young daughter Emily had taken its toll on the both of us. We had barely spoken to each other in months. So when the day she told me that she wanted out came, I’m not ashamed to say a part of me was relieved. My relief was short lived however. She presented me with a bag of clothes and told me to find somewhere else to live. I won’t lie, I was angry. I mean, SHE was the one who was quitting the marriage, why should I have to leave? I may have said some things that I’m glad our daughter wasn’t around to hear.\n\nAfter two months of staying in cheap hotels I finally found a place. It was stupidly cheap, I had my doubts but my ex refused to let Emily come and see me before I’d found myself some permanent place to stay. I missed her so much. I’d often heard how having a child changed you but I never truly believed it till she was born. She was always perfect to me, with her golden hair and little snub nose. She always had me wrapped around her little finger. Even when she’d been naughty, all she had to do was smile at me and I couldn’t bring myself to stay angry at her. When I opened the door to my new flat all I was thinking about was how she would be allowed a visit in a few short days.\n\nGod, that place was a shit hole. The walls were stained, the appliances were gross. I spent my entire first day just trying to get all my stuff moved in. When I finally got the chance to go to sleep I spent half the night being kept awake by music from a car outside. I had to bury my head under a pillow to get even a semblance of peace. When I woke up in the morning I was covered in insect bites from the tips of my fingers to my elbows. I was just glad I’d worn a T-shirt. It seems even the local wildlife was out for my blood. At least it wasn’t just my ex-wife. The spots where they had pierced the skin to sate themselves on my lifeblood itched terribly. I went to the bathroom hoping that a wash would ease my pain. I opened the bathroom cupboard to get the soap when I saw a tube of cream. It must have been left by the previous tenant. The label had been mostly rubbed off but when I unscrewed the cap it smelled antiseptic. I really didn’t want to wait for the chemist to open, the itching was too intense. I squeezed out a generous amount of cream and applied it liberally over my hands and arms. It stung like hell, but that at least meant it was working. It certainly soothed the itching at any rate.\n\nThe rest of my day was taken up by cleaning. I pulled on the rubber gloves and got to scrubbing. I didn’t stop until the place was spotless. If Emily was going to come over I wanted it to feel like a home. Somewhere we could be together instead of some depressing pit where her father now lives.\n\nI didnt stop until late into the evening. When I finally peeled off the gloves I noticed that the bites on my hand had somehow got bigger. What were once red pinpricks were now almost holes, deep and red. What I found especially puzzling was how there were no scabs or blood. Just a crimson redness. I assumed it was because I’d worn the gloves all day. I cursed myself for being so foolish and applied some more cream. I ate and decided to go to bed after watching some TV. Thankfully there was less noise to disturb me. I remember thinking how things might just work out after all.\n\nI awoke the next morning to the phone ringing. I blearily answered and heard my ex-wife’s voice on the other end of the line. She irritably informed me that if I was still going to have Emily over to mine that afternoon, she’d need to see photos of my flat. Otherwise she would not allow Emily to see me there. As if I wouldn’t have tried to make it perfect! I took some photos with my phone and sent them over and she begrudgingly agreed that it was acceptable. Whilst I was taking the pictures I noticed the wounds on my hand had gotten worse. Now each hole was rimmed with a thick, white crust that was hard to the touch. I didn’t want to scare Emily so I applied some more ointment and wrapped them in bandages. I looked at my watch. It was eleven am. Emily was due at three. That gave me time to put the finishing touches to the place and still have some time to relax. As I fussed around I could hear a repetitive tapping noise like claws on tile. I Immediately checked the kitchen and bathroom. The last thing I needed was rats. Not with Emily here. Thankfully I couldn’t find anything.\n\nAs the afternoon progressed it happened again and again. Every time I jumped up to check, there was nothing to be seen. I thought I was going insane! Still, it wasn’t enough to dampen my excitement. It wasn’t long before I heard the buzzer go off, signalling Emily’s arrival. I rushed down the stairs to the front door and there she was. My heart swelled at the sight of her. Even the sight of her mother glowering just behind her wasn’t enough to stop the sense of elation I felt. My daughter was finally here. My mind raced with all the fun activities I had planned for us as I bent down to take her up in a huge hug. As I picked her up I heard another tapping sound. This time louder and more intense than it had ever been before. I held her tight to my chest. Suddenly she started to wail. I felt a wetness on my arms and saw the look of fear on my ex-wife’s face. I tried to let her go but something was preventing me from moving my arms. Her screams increased in pitch as I heard the tapping noise increase till it was almost a buzz. My ex-wife grabbed my wrists and tried to prise Emily out of my grasp, only to cry out herself and pull her hands back. I saw that, where there were once fingers, there were now only bloody stumps. Emily finally managed to wiggle free and as she fell to the ground I saw her back was a tangled mess of meat. Bits of bone were visible in the bloody mess. I stared at my hands. The bandages had come off. The wounds underneath were no longer wounds, they were mouths. Each with its own set of razor sharp teeth, chattering away with lethal intent. I began to scream and as I did, a hundred mouths screamed with me."
	},
	{
		"name":"Nuckelavee",
		"category":"Creature",
		"number":"So what is the Nuckelavee?\n\nThe Nuckelavee is a monstrous type of fairy found in the folklore of Scotland and the Orkney Islands. It is as far removed from our modern conception of a fairy as possible, and its name is still considered unlucky in some parts of the Scottish Isles.\n\nA horrific demon of the seas, Nuckelavee was a godlike horror that was intangible and invisible while in the sea, taking corporeal form only once it reached land. The form it took was akin to a living nightmare and was described as either a horse, a man, or a fusion of both. In both forms the fairy was skinless, with pulsating veins and muscles exposed.\n\nNuckelavee was gigantic in size, yet its features were grotesquely mismatched with a head so horribly large, it would roll to one side. Its arms were so long they'd drag along the ground. In addition, Nuckelavee's hands were monstrously huge: often it would have only a single Cyclops-like eye on its head. The horse's legs were said to be akin to flippers.\n\nFurther horror came from Nuckelavee's gaping mouth, which was filled with rotting fangs and a supernaturally putrid breath that could strike living beings dead or infect them with disease. The creature spread all manner of catastrophe to mankind and was said to be responsible for plague, famine, drought and more. According to legend the Nuckelavee's power was only rivaled by its undying hatred of humanity.\n\nThe burning and harvesting of seaweed was said to invoke the Nuckelavee's wrath even more than usual. In retribution the evil fairy would inflict the islands' horses with a deadly disease known as mortasheen.\n\nOnly two possible ways existed to stop the Nuckelavee: the fairy's inability to cross freshwater and the intervention of a benevolent spirit known as the 'Sea Mother' who held the power to undo Nuckelavee's curses and drive the demon back to the depths (she was presumably a powerful fairy or angel, perhaps even an aspect of some ancient goddess)."
	},
	{
		"name":"The Dog-Men",
		"category":"Creature",
		"number":"I met my best friend Ben when I was nineteen. We started a degree in music together and had absolutely nothing in common, which we loved about each other. What shocked us was how in sync our childhoods had been. From being born two weeks apart, to the age of twelve we shared a lot of experiences even though we never met. I remember Ben telling me about a VHS he used to have with Huxley Pig and Will Cwac Cwac cartoons on it, saying how obscure it was and how I'd love it. I replied that I knew exactly which VHS he was referring to and also still had copy of it. This sort of thing happened a lot between us, so we liked to quiz each other from time to time then joke about how different we were for our identical upbringings.\n\nOne night when I was staying over at Ben's house we got on the topic of kids' ghost stories. I love creepy stories but Ben hates them, so the conversation was slow going at first. We started with the usual stories kids in the neighborhood spread. It was funny how many of our towns' stories were exactly the same for being opposite sides of the city and river, ten miles from each other. The dilapidated places were always haunted. We had both heard about a one-eyed black cat nobody owns that watches the children play out. The list of stories went on, as did the similarities.\n\nBen got surprisingly into the discussion. 'So you've even heard of this story?' Etc. To which I confirmed or told my town's slightly different version of the story. That's how the night progressed. After we exhausted the conversation he ended with, 'Even to this day I'm still scared of the Dog-Men, so please tell me you've heard that story too.'\n\nI just remember being dumbfounded, saying I had no idea what a Dog-Man was. As far as I'm aware the 'Dog-Men' story is just in Ben's town. We tried looking on the internet but Ben was too easily freaked out by pictures and scary stories that popped up as we searched. The Dog-Men really grabbed my attention. Usually kids' ghost stories go into so much detail, like the color of the ghost's dress, or the exact way the hair hangs over the ghost's eyes. But there wasn't much information about the Dog-Men. The details were vague.\n\nHis words at the time were something like: 'The older kids who were allowed out the street told us about Dog-Men, who stood around in the alleys at night, and the older kids were shamelessly scared to go there when it got dark.'\n\nObviously it was thugs or druggies, I explained. But he was adamant. No, because they ran away when they noticed the kids watching them. They'd climb up the high walls of the back alley into peoples' back yards really fast, without making a noise. The older kids wouldn't talk about it unless pushed. He said their feelings seemed too real to make it a joke to scare the younger kids. His childhood friend Wes claimed to have saw one too. The story goes the Dog-Men would be found standing in small groups or more often solitary in the middle of an alley, looking for scraps of food, not doing much else.\n\nBen seriously thinks he saw one with his mom one day walking back from the shops. Apparently it was in a fenced off area where a block of flats had been demolished a few years earlier. At the opposite side of this land he saw a skinny, hunch-backed man cupping his hands full of water from a stream which ran through the plot, washing his long greasy hair. Almost ritualistically. Even though he didn't see the homeless man's face and was quite far away to make out details, he swears something about that man wasn't quite human. I blamed a child's imagination and exaggerated memories. But he swears it. He showed me the area that next morning. If he and his mother are remembering correctly, I have no idea why even a homeless man would wash his hair in that dirty stream.\n\nI first met Wes a few weeks after the night I learned about the Dog-Men and didn't hesitate to ask for his first hand account of the Dog-Men. It was the main reason I decided to meet him after all. His description was similar to Ben's but his encounter was far more close-up.\n\nWes lived further from the local corner shop than Ben and used to take a shortcut through an alley when he walked there. The wheelie bins were out that day. He said he could hear a cat or dog feeding on some discarded food behind one of the bins. It happens a lot and everyone knows to keep a distance so the dog won't get aggravated and attack.\n\nBut Wes said the dog didn't look right. He only got a quick glance before it ran behind a wall with a rotten roast chicken hanging from it's mouth. According to his memory, it was running more like a hyena than a normal dog, with its shoulders held much higher than its hips. The snout was too short, and the ears were more elfin than a dog's. He can't remember if the creature had fur or not, but it definitely was naked. Not long after, he overheard the older kids talking about the Dog-Men and realized what he had saw.\n\nI like Wes. He has a doubting attitude akin to mine, and admitted his memory may have been influenced by the older kids' stories. It could have just been a normal dog struggling to carry a whole chicken away after being startled.\n\nThe story lay dormant, not mentioned for months after I spoke to Wes. In that time I had moved away and have only managed to visit Ben three times since then. The last time I met with him we decided to go to the local takeaway in the early hours of the morning, and I got my very own encounter of what could have been Dog-Men.\n\nRight on the same abandoned plot where Ben saw the homeless man bathing, there was a decent sized fire burning. I could make out possibly three silhouettes huddled around the flames. Ben's area is pretty rough so this isn't an unusual sight, but I don't know how to describe it; Those figures weren't moving naturally. My view wasn't great because Ben wouldn't move closer than we were, but I swear those silhouettes never stood completely upright. We watched them for about five minutes. They were hunched over with their backs to us, warming their gloved hands by the fire with their hoods up. I remember one of them moving closer to the fire while keeping its hands on the ground. It would have been easier to just stand and walk closer, but it shuffled awkwardly using its arms. Everything about their movements were indescribably awkward.\n\nI was so excited. It had to have been the Dog-Men. I didn't want them to spot us so we left pretty soon after, but I forced Ben to visit the bonfire with me the next day. There was just a milk crate sat next to a charred circle on the ground. Nothing to prove these beings were inhuman. Strangely, there were bones in amongst the smoldering papers and branches that had been burning the night before. We could make out sooty hand prints where at least one of the homeless people had presumably crawled directly over the charred ground. The trail of hand prints led away from the bonfire and faded after a couple of meters. That was all we found. We walked away feeling slightly silly, laughing at how we had probably been stalking a trio of drunk tramps.\n\nHowever Ben's realization unnerved us terribly. As the hand trail faded, he pointed out a large paw print becoming more and more prominent in the middle of the fading hand prints. Then it struck me why I found their gait so weird the night before. As that man had walked closer to the fire, he placed his feet in exactly the same spot where his hands had been.\n\nWe stared in shock, not sure what to make of the trail. Then the yelps and growls of dogs fighting came from a bush uncomfortably close to us. I'm not ashamed to say we ran away crapping ourselves. Maybe it was just a pack of dogs. We didn't care to look, and I'm never going back there to find out."
	},
	{
		"name":"Goatman",
		"category":"Creature",
		"number":"You say you love Native American legends? Have you heard of the Goatman? No? Then please allow me to enlighten you.\n\nI heard the legend when a power outage on our reservation made us decide to have a fire. As we all know, nothing goes better with a good fire than a good story. That was where I learned about Goatman.\n\nThe legend goes that they shapeshift. They love human forms most of all, which is what makes them so dangerous.\n\nIt's thought that if you find a bone of one or take a photograph and keep it in your house, it will wait.\n\n'For what?' you ask. The answer is, they wait for you to leave. Once you leave, they ransack the place until they find what you took from them.\n\nThere was even an incident, I heard that night, where some men met the Goatman face to face.\n\nIt was a night like the one I was experiencing. Some men had decided to have a fire in the desert and told some stories around it. Then a stranger walked out of the desert and took a seat, never speaking a word. No one really got a good look at the stranger.\n\nOne man brought up the legend of the Goatman, causing the stranger to listen a little more closely. At the end, the other men nervously laughed, the stranger still silent.\n\nThe men decided to go back to their homes and put out the fire. They didn't have enough room for the stranger, and figured he could hitchhike back to town.\n\nThey had just left when they saw something chasing after their truck. Afraid, they sped up. The creature sped up its pursuit as well.\n\nWhen it reached the truck, it flipped it over and dragged three men off into the night.\n\n'What happened to them?' you ask. Well, they were never found.\n\nBe careful of the Goatman. They can shapeshift, didn't I tell you? That homeless man begging for change could be one. Or your boss, teacher, or even your friends."
	},
	{
		"name":"A Walk in the Woods",
		"category":"Creature",
		"number":"It was a calm summer's day in the woods of Central Mississippi, and he walked through the forest, enjoying his time, when he heard a loud rustling to his right. Instinctively, he ran to cover, as to not be spotted. Through the gaps in the bushes, he saw a strange, pink creature walk through the underbrush. It was somewhat like himself, but he didn't think it could be one of his species, for it was much too short and scrawny, even for a young member. It also had an odd, slender, shiny appendage protruding from its back.\n\nCuriosity overcoming his fear, he decided to follow the strange pink thing. The creature didn't seem to know where it was going, for it would often stop and look around, with a confused look on its ugly, hairless face. As he was walking, he accidentally stepped on a twig, which caused the creature to whirl around suddenly. He panicked and ducked into a bush, but the creature followed in hot pursuit. He ran and ran until his legs would no longer carry him, but the creature had somehow managed to catch up with him. He hid behind a tree to catch his breath, but the creature soon discovered his location. In utter horror, the pink creature whirled its skinny appendage around into its thin arms, glinting brightly in the afternoon sun, and a bright flash appeared out of the end. He felt a searing pain in his chest, and looked up, only to see the creature's appendage flash again, after which he fell to the ground, dead.\n\nThe young hunter, stunned by his recent experience, examined the thing that he had just shot. It was large, bipedal, and covered in hair. It lay on its back, one bullet hole in its barreled chest, and one between its eyes.\n\nHe stood in amazement and blurted out, 'Holy crap! I can't believe my eyes, I've just shot and killed an actual Bigfoot! I've got to bring it with me, or no one will believe a word I say.'\n\nTo which he hauled the creature's corpse out of the forest, back to his pick-up."
	},
	{
		"name":"The Bunny Man Bridge",
		"category":"Gore",
		"number":"After the Civil War, Fairfax County, Virginia, USA became more populated, and eventually an insane asylum was built there. No one wanted to live near the asylum and because of the public outrage, the institution was then shut down later.\n\nThe administration transferred the patients in 1904, once the process was completed. During the transfer, some of the patients escaped and hid in the surrounding woods and forestry.\n\nThese individuals were lost, delusional, and dangerous. Most of them were found, except Marcus Lawster and Douglas Griffin. The local authorities found a trail made by the two men; it was littered with half eaten mutilated bunnies.\n\nThe trail led deep into the woods to a tunnel crossing a wide creek. There they found Marcus hanging from the tunnel entrance, with a note attached to his foot. It read, 'You'll never find me no matter how hard you try!' Signed, The Bunny Man; that tunnel has been called Bunny Man Bridge ever since.\n\nThe legend says that if you walk all the way down to the tunnel at around midnight, the Bunny Man will grab and hang you from the entrance of the bridge.\n\nStrange deaths and phenomena have constantly been connected with the Bunny Man Bridge. There was a young man from Clifton, Virginia who came upon the bridge while traveling. Later, he killed his parents and dragged their bodies into the woods to hang them from the bridge, before he killed himself. In 1943, three youths were found dead, hung from the bridge. Their bodies were slashed open and all had notes attached to their feet; all of which stated, 'You'll never catch the Bunny Man!'\n\nIn 2001, after hearing the tale, six local students and a guide searched the area only to find mutilated bunny parts during their search. They soon left the forest after they heard noises and caught glimpses of figures in the woods"
	},
    {
        "name":"German Steel",
        "category":"Gore",
        "number":"I saw it in one of those cookware stores, a magnificent knife, German steel, so clean you could see your reflection in it. Being a chef, getting the job quite recently, in fact, I thought some equipment of my own would be just fine and dandy. I also had a second job as a butcher, so I figured it should be useful then, too. I took a look at the price, and it was an outrageous price, $550! I had to be able to find a knife like that at a better price.\n\nI looked on Craigslist and after a week or so, I got a nice, German steel knife, just like the one I found in the store. For only $20, too! I gladly accepted, and when I came home later from work, I brought home some leftover beef sirloin from work. I unwrapped the knife, and took a hold of it. With that knife in my hand, I felt good. Really good to be exact. I cut through that sirloin without any effort or resistance whatsoever.\n\n'Amazing!' I proclaimed.\n\nI continued cutting the meat into thin slices, and cooked them. I made a beautiful salad, without having to slide the knife. Once it was all done, I ate, and it tasted more magnificent than any other thing I had ever tasted. I wondered how strong this knife was. Once I finished and did the dishes, I proceeded to wash the knife. Once that knife touched the water, it was spotless! I smelled it (out of natural curiosity) and there was the clean scent of lemons.\n\n'Smells so fresh,' I commented.\n\nI proceeded to test the knife's strength and sharpness. I took an old, unused tin can. I placed the knife's blade gently on the side of the tin can, and started sawing. To my amazement, in only two slides the can was cut cleanly in half. I took one half, and took the sharp edge of the can to a torn piece of silicone from a cupcake mold previously thrown out, and it slid right through!\n\n'Incredible...'\n\nA few days later, I had decided to go hunting. I grabbed my rifle and went out in my truck. I managed to get a fairly good sized deer. I had brought my knife with me, just in case. I went over to the buck and dragged back to my vehicle. I thought that, since I brought my knife, I might as well, so I dressed the deer right on the spot, out here in the middle of the forest. Its blood was warm on my hands, and it was almost dead, but still clinging to life as I gutted it and such. When I returned home, I roasted that deer, a meal even better than the last. I was pleased with my work. I soon tried all kinds of food, but it had to be cut with that knife. I became closer and closer with it, taking it everywhere I went.\n\nOne day, I was out for what I thought was only a few hours, and when I returned home, my girlfriend was worried. She said I'd been gone for weeks on end. She also knew about my beautiful knife. She told me it was a problem, and I had to part with it now. We struggled over the knife, but we eventually reached an agreement... sort of. When I realized she had been telling the truth, I contemplated about whether or not I should get rid of the knife. But, I decided against it. After all, this knife is mine now, it's the best thing in the world, it's my life. But what was the agreement? Let's just say that human meat doesn't taste very good..."
    },
    {
        "name":"Maybe",
        "category":"Gore",
        "number":"Maybe if you keep going, the voices will stop. Maybe if you keep on going, your head won't feel like it's about to explode into shards of bone and bits of grey matter all over the old log cabin's sparsely furnished interior.\n\nMaybe.\n\nMaybe you hit her over the head with a tire iron because the voices told you to; maybe, just maybe, you may have even told the voices to tell you to. Maybe it was the voices that told you to take her to that place, that cabin in the middle of those ancient woods. Maybe they told you to bind her arms and legs with those bungee cords you have had lying in your trunk for the past year or so. Maybe you thought they'll leave you be, they'll finally leave you be, and you can sleep again, drift off into the unconscious void that has eluded you since as far back as you can remember.\n\nMaybe.\n\nMaybe, just maybe, if you cut her a little, the screaming will stop. The screaming coming from her; the screaming coming from you; the screaming coming from all around you and inside of you and from nowhere and from everywhere all at once. Maybe you liked the way you began - tentatively, at first, putting nearly no pressure on the box cutter you swiped from work. Maybe you were entranced by the way the blood came out, dark and red and sticky and wonderful. Maybe the voices told you to keep on going. Maybe the voices will stop if you cut a little deeper, press a little harder.\n\nMaybe you liked cutting up her arms, exposing musculature and ligaments and tissue and nerve endings. Maybe you liked the way you pulled on those funny white cords in her forearm; maybe you liked the way her hand twitched and how she screamed and shrieked and pleaded with you when you did. Maybe the voices told you that she could not see the rest, she could never see the rest, she could only feel what you were doing from that point forward, she could only feel the blade sinking into her delicate flesh again and again and again and again.\n\nMaybe.\n\nMaybe you liked the funny colors that came out of her terrified, wide eyes as you plunged the box cutter into them, twisting and turning and scraping. scraping and cutting and laughing. Maybe you liked the way it tasted, as you leaned in and greedily lapped the bloody goo coming from her desecrated eye sockets. Maybe the voices told you that it would taste good. Maybe it did.\n\nMaybe.\n\nMaybe you liked turning her loose and letting her run around the room for a bit, screaming and shrieking and crying blood and pus, blood gushing and spewing from her mutilated arm. Maybe you liked tackling her, ripping her dainty little skirt off of her dainty little hips. Maybe the voices liked it too. Maybe you liked the way she shrieked louder and louder and louder than ever before when you spread her firm ass cheeks open and sliced up her rectum, over and over and over again. Maybe you liked the sound it made when you shoved the box cutter into her ass, inside of her, all the way to the hilt - that lovely squish, squish, squish.\n\nMaybe.\n\nMaybe you liked the way you had reduced her once perfect little ass to a quivering, pulsating, twitching, absolutely useless pile of flesh. Maybe the voices told you that would taste good too, that is the best meat of all. Maybe it was. Maybe you liked what you had reduced the rest of her to, a quivering, twitching, shrieking and useless pile of flesh, bleeding and sobbing and crying on the hardwood floor. Maybe you thought, despite all the shrieking, she could still shriek louder. The auditory fruit of your labor. The sublime sound of unimaginable torment, of unfathomable anguish. Maybe you knew that there was a bottle of lye in the bathroom; maybe the voices told you it was there. Maybe you knew about the funnel in that old, creaky drawer next to the rusty sink; maybe the voices knew it was there too.\n\nMaybe.\n\nMaybe you liked the way her shrieking and pleading was reduced to inane gibberish, shrieking sobbing crying gibberish, unintelligible words and sounds, louder and louder with each squeeze of the upside-down bottle. Maybe you were intoxicated by the smell of flesh being burnt chemically, hissing, popping, and squishing. Maybe you liked the way the blood oozed out of her destroyed hole faster and faster and faster than before, dripping. Drip, drip, drip, drip.\n\nMaybe you liked the way all of her limbs seized up, and the funny way she twitched and undulated and thrashed around the blood-smeared floor. Maybe the voices did, too. Maybe you liked the way that she went still all of a sudden, blood still pouring from her. Maybe you were absolutely delighted, grinning ear to ear, shouting in utter vicarious ecstasy as she shit herself after she died, warm, fresh shit filling the deep wounds and gashes and cuts and tears inside of her, leaking and oozing out, blood-covered and smelling absolutely wretched and lovely and horrid and sublime.\n\nMaybe you liked watching her die. Maybe the voices did, too.\n\nThen again, maybe there were never any voices at all."
    },
    {
        "name":"Scare Crow",
        "category":"Gore",
        "number":"My parents, who were avid gardeners, got a scarecrow a week ago. Though there wasn't much of a crow problem in the garden, I shrugged it off and started to look at it. The weird thing was that it had not a single piece of straw sticking out of its wool-like body, almost professionally made. It had buttony eyes, and a stitched up mouth. I could never really figure out why it was made with wool, my parents said that it was an unimportant question, so I just stopped asking.\n\nIt started freaking me out because crows pecked on it the day after it was made and there was still no straw whatsoever. I decided to investigate that following night by walking up to it with a pocket knife and cutting a hole in it to see if there was any straw or if it was just stuffed with fluff. After I cut a hole, it... moved. It bent its arms. I tried reaching my hand out but the scarecrow literally jumped and started screaming in horrible, agonizing pain. I ran for my life to my workplace and closed the drapes. His screaming lasted for about 15 minutes before I opened the drapes and saw that it was limping towards my window. I started screaming for a brief second, but covered my mouth as my parents were asleep. But how could they not be awakened by the scarecrow's screaming?\n\nIt broke my window and what I saw will traumatize me forever.\n\nIts stitched up mouth was now ripped open, it was a dark crimson red. It lifted its hands to its head and stuffed its fingers into its eyes, making a sickening squelch as it entered and slowly exited its now missing eye sockets. I fumbled for my pocket knife again and stabbed it in the stomach two more times. It screamed even louder and lurched backward and tried to regain its balance. I just watched in horror anticipating its next horrible move.\n\nIt stopped screaming, and violently clutched its head. I knew exactly what it was about to do. It pulled wildly, seams ripping from its neck. It finally tore its own head off. But... There was no straw.\n\nInstead, there was thick, dark red blood, pouring out of its head and stump. Falling over, I thought I heard a whisper of someone asking for help. I sat on my bed for almost half an hour contemplating what had just happened. I couldn't gather anything. I could barely sleep that night. I only got about two hours of rest. I asked them if they had even heard someone screaming, and they thought I was delusional for talking about a scarecrow that moved and killed itself.\n\nI went back to my room and found a dead crow with its head torn off on my desk."
    },
    {
        "name":"Last Level",
        "category":"Gore",
        "number":"Are you familiar with the game 100 Doors of Revenge? If not, I'll explain the concept. Simple problem, such as getting into the elevator to continue on. Complicated solutions. Games like that kinda get under your skin until you can move on and finally beat the game. Then someone made a game called Saving Skyler. When asked about the older-style graphics, the developers replied they had a lot going on in the last level and wanted the game to run quickly without taking too much storage. They sort of teased the Game Informer readers by being all mysterious about the winning level. They gave a little info on the background, though. A boy's mother abandoned him, and he starts drawing pictures on a computer of her in deathtraps with a little hero trying to save her and failing. You play the hero in the picture, trying to make her live on until the next picture/level.\n\nSam, a big fan of iPad games of that genre, could hardly wait for it to come out. When it did, he played every time he got the chance. Level One was an apt demonstration of how the game worked. Skyler was shackled to the floor. There was a sandbag attached to a rope, and Sam unwittingly picked it up. The rope snapped and a blade descended on Skyler's head. Her arms flew up, blood sprayed, and the words I WIN flashed on the screen. Sam tried again. He tried to move her before the blade came down, he checked if the shackles were really locked, he tried using the sandbag to block the blade. He was legitimately pissed when he noticed the tiny bit of gold at the foot of the stairs. A key. Damn. He unlocked the shackles, and he and Skyler ran off, only for her to get lost and trapped again.\n\nKnowing how the mechanics worked, Sam got pretty far. One level stumped him only because it was so simple, but he figured it out. Then he reached level sixty. It was Skyler in a glass tank. There was a shovel on the floor, as well as knobs and a stick. The graphics were different. Not exactly modern, closer to the early The Sims graphics. First, Sam picked up the stick and picklocked the tank. It opened, then he climbed inside to fetch her and the door slammed shut behind him. The time went on fast-forward to a month later. Starving, he and Skyler were eating each other. Skyler won.\n\nI WIN flashed again. Sam was disturbed by the blood, but he wanted to win the game. Next plan. He took the shovel and started beating the cage with it. Sam noticed the hero looked irritated. And the more he beat the cage, the more the walls fell in. Skyler was crushed. Sam almost spat at the screen when I WIN flashed yet again. He hadn't beat 59 levels to stop now. He flicked the first switch when the level reloaded. Fire shot from the walls of the cage, leaving a seared, convulsing corpse. Sam almost dropped the iPad. He was used to gore on big screens, not in these games. I WIN. Yet again. Sam wasn't going to be freaked out, irritated and startled only to lose. He pressed Restart Level. The second switch this time. It would have to work eventually, right?\n\nYes. Completely right.\n\nAcid. Piranhas. Blades. Cheese graters. Vomiting up insides. Everything. Sam couldn't count how many times he watched Skyler die, but the game kept track. It had just played the 'gone wrong' sound when Sam hurled the iPad to the floor and started running. The horrifying, angry look on the hero's face. Skyler's dying screams, over and over, changing only in intensity. And those words. I WIN. Sam had never won. It was all for nothing if you couldn't beat the game. And he couldn't. He was screaming at the top of his lungs, running down the street with only the vague idea of killing Bording Studios. He could feel the nightmares coming as you can feel the snapping of a branch.\n\nTwo Months Late.\n\nSam had died in his sleep in a ditch. No one had found his body yet, but people had found a different thing to talk about. A video was making its rounds in Youtube: the 60th level of Saving Skyler beaten. Well, not really beaten. A guy had hacked the system to make it run over what all had to go down before you'd won the game. According to the guy, you had to lose 500 times before a special item appeared. A pistol. By this point, the hero's face was contorted with rage. It was a clue. Take the pistol. Kill Skyler. When the hero did this, shooting her four times between the eyes, I WIN didn't flash. Instead, in a child's voice you heard:\n\n'But... But... No! You can't do that! You're supposed to save her! All I wanted to do was scare her into loving me again!'\n\nThe child's voice sobbed during the credits."
    },
    {
        "name":"We Make Guns",
        "category":"Gore",
        "number":"We make guns.\n\nWe don't care who the gun's going to kill, who's going to pull the trigger—we don't care about any of that.\n\nWe need good old leather to get a firm grip on the trigger—half the gun's about you holding it in the first place, so we put genuine leather onto the grip. But, well, recently, we've been having a shortage of cows. You know, the nuclear gizmos and all that good stuff. So we take matters into our own hands.\n\nLike I said, we don't care who the gun's going to kill, and who's holding it in the first place. So we go to this town out in the middle of nowhere. Fancy little survivor settlement.\n\nWe shoot everyone there. Skin them to kingdom come. We take the skin back, dry it out. It's not the best, but, well, it would have to do.\n\nThen we realize that we're running out of bullets. Real, steel bullets, built so that it could make a pretty darn decent dent in a one-meter thick sheet of metal. No bullet, no shooting. The mines are running dry. You could predict what we did next.\n\nAnother fancy little settlement—this time a few more people than before. They're holding our guns. They use them to fire back, but we win in the end. Same deal. No survivors. Skin 'em, bone 'em. It's not the best, but, well, it would have to do.\n\nAnd then now we're realizing that we're running out of food. Some men try to desert—we shoot them and take the whole deal, bones, skin, meat, all the good stuff inside. It's not enough, though, and we've already massacred most of the settlements in the surrounding area. We send some squads away to kill more, but it's too little, too slow.\n\nSo that's when we put the big holographic thingy up in the sky: 'FREE FOOD AND SHELTER AND WEAPONS'. Attracting guys like you. Oh, I get it—you're thin and weak and all that. You're not the best. But you'll do.\n\nCall us murderers, call us psychopaths, but we only came to do one thing, and one thing only:\n\nWe make guns. "
    },
	{
		"name":"Clingers",
		"category":"Real",
		"number":"We call them ‘clingers’ at the station. I know we really shouldn’t, but thinking of them as people just makes the job so much harder than it already is. I am a First Response Paramedic; the one that arrives at the scene of a serious accident or injury to stabilise the patient before the ambulances take over. I’ve seen a lot of things that I wish I hadn’t. I’ve seen car crash victims with limbs occupying seats that the rest of them wasn’t. I’ve seen motorbike riders that have skidded on asphalt at 150km/h without protective gear. I’ve seen what a sawn-off shotgun does to a human face. All of those things take a toll, but nothing gets me quite like clingers do.\n\nYou see, most people think death is quick. It isn’t. Even when subjected to enormous physical trauma, the human body can survive for a surprising length of time. Bleeding to death, particularly internally, can take minutes even if almost every bone is broken and the organs are damaged beyond repair. Massive hemorrhaging reduces blood flow to critical organs, which causes blood acidity to rise and body temperature to reduce. Clotting responses are impaired, meaning bleeding cannot be stopped. Death is inevitable, but in a cruel twist, it takes time. Time spent suffering and clinging to pointless life.\n\nEvery time, their reaction is one of surprise and often regret. People think that jumping off a building or stepping in front of a train will end their existence in the blink of an eye. If they’re lucky, they pick a very tall building or a very fast train, but often they don’t. They lie broken on the concrete slowly drowning in their own blood, with their eyes expressing utmost regret. They never expected to suffer in this way, and all I can do is sit with them to provide something that resembles companionship as they slip away. What bothers me about these clingers is not the regret on their faces as they die, though. It is the wide-eyed expression that almost looks fearful as they finally drift off the mortal coil that chills my blood.\n\nThe night that haunts me to this day saw me sitting in the misty rain beside the train line, holding a young woman’s hand as she slowly choked on her own blood and gore. She had stepped out too late, they almost all do. The impact is with the edge of the train, deflecting them off the track rather than throwing them under the carriages. The results are rarely immediately fatal. A look of shock and sadness filled her eyes as she contemplated how forty thousand tonnes of freight train had failed to end her in an instant. Her eyes slowly transitioned to an expression of fear as they all do, but this woman talked.\n\n'I… can see…. what’s… holding…' she trailed off, coughing as blood filled her mouth again.\n\n'I can see what’s holding… the light at the…. end of the tunnel…. And I don’t want…. to die anymore.'"
	},
    {
        "name":"Bikini",
        "category":"Real",
        "number":"It was June 2, 1946 when the first nuclear test occurred at Bikini Atoll, but it certainly wasn't the last. Between 1946 and 1989 there were a large number of atomic explosions which hit the uninhabited islands, detonated by the United States.\n\nAs a result, several radioactive isotopes - the most notable being Strontium-90 - were released into the atmosphere and soon irradiated the waters surrounding the islands.\n\nIn 1976, during a cleaning process it was discovered that there was life located at the bottom of the surrounding ocean. Using specialist radar technology it was determined that these creatures were unusual because they had adapted so as to inhabit artificial constructs within large communes.\n\nIn the short while Bikini Atoll was temporarily inhabited prior to when Caesium-137 began to take effect in 1982. US troops were known for leaving things behind, including buckets, chests and tin-cans. When one of these islands sank as a result of the 'Castle Bravo' nuclear test on March 1, 1954, these items ended up at the bottom of the ocean.\n\nFor some reason the sea-creatures encountered in the 1976 expedition were more intelligent than usual. They had utilized this waste and had began to live within them, treating them almost as part of their natural surroundings. Animals such as crabs began a primitive form of civilization similar to our own.\n\nSome land-animals were sent down in specialist suits so as to adapt with these sea creatures. This selected group continued to be exhibited up until 1998. A person working for the corporation Nickelodeon in a tour funded by the company was one of the few people who saw these creatures in action. This eventually provided the inspiration for a certain popular children's television program.\n\nSpongeBob SquarePants..."
    },
    {
        "name":"The Message",
        "category":"Real",
        "number":"Don't dismiss this outright as the work of some raving lunatic. There's some sense to this story, if you'll just hear me out...\n\nLook, we all wonder if time travel is possible, right? Well let me tell you something... it is. I'm from the future, actually. I know you probably don't believe that, but seriously, I'm from the future. It's a really great thing; getting to see the past, watching events unfold... stuff like that. We know more now than we ever would.\n\nBehind all the fun, though, there is a more serious aspect. We aren't supposed to go into our own lifetime, and we are never allowed to contact our past selves. Let me tell you, I'm breaking that rule right now. Yes, you're talking to yourself. Your future self. I'm going to be executed for this, but you know what? I accept that. I'm preventing something by talking to you that is worse than death. I can't tell you outright what to do, because the filters would catch it. This is the closest I can get, trust me. I can, however, send a little message.\n\nYou should probably read the first word of every paragraph, now."
    },
    {
        "name":"Loneliness",
        "category":"Real",
        "number":"Think of the most solitary place you can imagine. The most isolated, lonely location you can possibly conjure up: a claustrophobic, dirty cell; the peephole in the door forever unused; an island eternally floating in a sea of darkness, the shadows hiding everything you can, and can't, see; a quiet, wind-whipped plain where no directions exist; a desert landscape, all sound muffled by the driving winds and buffeting sands, where half-seen shapes roam the horizons.\n\nImagine spending an eternity there. Terrifying thought, isn't it? Mull it over for a while. An existence with no beginning and no end, alone with your mind and nothing else.\n\nRight now, it's a scary scenario.\n\nWhen you get to the afterlife, it won't just be a scenario anymore."
    },
    {
        "name":"Jaywalk",
        "category":"Real",
        "number":"There is a way to live well beyond your appointed time. You need a car, preferably something late-model, with a strong body. Newer cars tend to be too light and not do enough damage. Next, you need to find a candidate. It has to be a pedestrian, and it's best to pick younger people, as they have more time left, but not always. You'll have to watch them, if it's late just drive slow and pretend to be lost, but if you have to, make a second sweep by going around the block.\n\nYou have to do this on a black asphalt road with a clear yellow line. You can ONLY hit a candidate that does at least one of the following:\n\n1. Crosses directly across the road at a run, without looking around.\n\n2. Walks for more than eight feet on the road itself without touching the sidewalk or curb.\n\n3. Stops walking or sits on the yellow line for more than three seconds.\n\n4. Trips or falls on any pothole or uneven surface in the road and bleeds because of the fall.\n\n5. Drops a personal item (key chain, phone, etc.) that shatters, with all the pieces remaining between the yellow line and the sidewalk.\n\nIf a candidate does any of these, it's an indicator that they are temporally detached from their “time”. If you hit and kill them with your car before they reach the next cross street, you can swap your time for theirs. If you were going to die tomorrow, but hit a valid candidate who won't die for eight years, you now have their remaining time instead of yours. It's unclear what happens to the candidate's soul, but it's probably not good.\n\nThere's a group, mostly old folks, who do this all the time. The founder says he's over two hundred years old, and he looks it. The name is like, White Sunrise, or something similar. They had a web page for a while, but it appears to be gone now. I remember browsing the forums once, and the name George Russell Weller was being discussed. He apparently screwed up an attempt, and was being kicked out.\n\nJust be careful out there. I've noticed a lot of older folks skimming around suburbs lately, watching kids rather closely. Stay on the sidewalk, and keep your head down."
    },
    {
        "name":"A New Day",
        "category":"Real",
        "number":"He fell to the cold floor with a wet plop as his lifeblood spilled around his head. His feet gave a small twitch before glowing limp. His glasses shattered when his face met the floor, shards lying around his head with his eyes closed, a small, black hole at the base of his neck where the bullet entered through. The others around you ran out screaming towards the door. One of them tried to quickly phone the police, dialing it on the phone before she looked up to see you and ran off to do so outside in fear.\n\nYou looked down at the murdered body of your best friend, the gun shaking in your hand at the action of it before it slipped off altogether. You backed into the wall behind you, crawling into a fetal position. You reminded yourself that this wasn’t real, this was all a lie. He wasn’t real, nothing was. It was all an illusion, a game that you were not willing to play anymore.\n\nAfter calming yourself down, you finally looked up at the exit. Some stray, morbid thought somewhere in that gone-mad brain of yours made a wise crack about taking the day off that you’ve been waiting for. Your body wasn’t getting any younger even in this world, as you slowly arose yourself to walk over towards the door, and opened them.\n\nAnd you were met with nothing.\n\nThe blinding light of grey, almost white covered your eyes. Gone were the neighborhood, the people, your car and even the building itself. Nothing remained but an endless, colorless plain. And with little option, you chose to walk through it. After all, you were expecting that you made a mistake and would have to go through this again. But today seemed to be different and you invited that in comfortably. The air was chilling, and large particles of dust moved along the ground as though a mist. Not that there was much to see anyways. You fold yourself in a bit at the cool yet silent winds to provide yourself with at least some warmth, which your worker’s outfit did not provide much of.\n\nIt felt as if the walk was an eternity. You were afraid that this is how you would now continue existing: just walking without a path. But, soon enough, you could make out a shadowy object in hindsight. You tried to squint your eyes to see what it was, and you could make out a bed with an IV stand next to it. You sat on the side of it. You saw her, your dead wife, lying on the bed with you beside her. She was always the optimistic one in your relationship, you recalled. Her eyes weakly fluttered open, and she gave you a smile. Just give it a few days, she told you when you asked her what you should do, but you knew that those days would never come. Her heart rate monitor grew weaker as you held her hand into yours, and you could feel it slowly wither away… and stop altogether.\n\nYou slowly got up from the hospital bed, picking up the family picture you always carried around in your wallet on the desk next to it before stuffing it into your pocket. There is something philosophical about this, you thought crudely to yourself. You tried to think of that ancient proverb, and it depressed you further as it came to you. You walked on.\n\nIn the misty distance, you could make out another object as you walked towards it. It was the water dispenser from your job. A dark spot of blackened blood was still on it when you killed your companion earlier today, and a sudden sense of grief and coldness washed over you as you heard his voice in your head.\n\nAre you going to be okay, Stanley asked you like he did this every hour, on every day.\n\nI’ll be fine, you responded as you slowly pulled the gun out and started to align it where the head meets the spinal cord when his back was turned and nobody else was looking. Just give it a few days, you assured him as you pulled the trigger and watched him slump over as he died.\n\nYou stared at the water cooler for a long time before you flipped it onto its side in a fit of rage with a scream, falling to your knees as you cried bitterly to yourself. You sacrificed your life for this, you realized; to escape and refuse to accept your reality. The emptiness that you so selfishly tried to escape from was catching up to you again, filling your mood. The nonexistent walls of this open, grey path felt as though they were closing in on you. Slowly you die – die alone on the inside. To pass from this hell is all you wished.\n\nWhen you gathered enough willpower to continue, you nearly tripped on something dark. You look down at your feet and saw the body of yourself. Your mouth was locked open with opened, glazed eyes staring blankly at the monochrome sky. There was a large hole in the back of your throat, bleeding out from your lips. Turning yourself over, you could see that the wound exited from the back of your head.\n\nYou looked ahead of you and found that there were more of these bodies around, all similar to each other, if not exactly alike. Each of them represented each day passed by, and you can make out entire weeks of this seemingly endless torture. You hesitated for several minutes before slowly walking over them. You tripped on the dark liquid, getting blood on your palms as you panicked before getting up to go again.\n\nIn the distance, you make out the last stop of the journey up ahead: your office desk. The chair was placed invitingly behind it, your lunch bag sitting on top of it. You picked it up and slowly opened it as you sat down. You tossed the sandwich aside, watching it fall and spill its contents on the ground as though a murder victim. From the bag you pulled the gun, looking it over. You checked to see that it only had one bullet inside of it; just one more death to go. Only one more person has to die… right?\n\nYou squeezed your tired eyes shut, along with the trigger of the stuffed gun in your mouth, seeing a flash of bright light before all existence faded to the familiar dark you have come to know all so well.\n\nAnd you woke in a cold sweat from your dream, looking around the dim bedroom with a fright. You tried to recall, but found that you could not remember anything, so you passed it off as just a nightmare."
    },
    {
        "name":"Keep It a Secret, Okay?",
        "category":"Paranormal",
        "number":"Three days ago... I killed my mother.\n\nI regret it now, but she drove me to it. She was suffering from psychosis, under the delusion everyday that I was constantly lying to her and plotting something horrible. She would scream at me, smash cups and plates, it sometimes got so bad that she would attack me. I was planning to save up enough money to move out and get her some professional help but I just couldn't take the stress. I threw her down the stairs one night when she attacked me which resulted in her neck breaking. Her mental health record was enough for investigators to accept that it was an accident.\n\nToday was her funeral day and my family members offered their condolences before and after the service. I felt awful knowing that if they knew the truth, their words may have been filled with hatred and resentment instead of sympathy. We then headed to my Aunt Victoria's place for the repast. I had come out into the back garden in an attempt to escape the suffocating attention I was receiving from my family. It was then when I saw my eight year old cousin Rebecca sitting alone on the bench whispering softly as if she was talking to someone. I approached her out of curiosity and in hope that her adorable, naive charm would cheer me up.\n\n'Hey Rebecca, what are you doing out by yourself?' I asked her in the soft tone one would usually take when talking to a child, as I sat down next to her on the bench. She didn't answer me for about five seconds. Instead, she just stared at me with a look of pity and concern in her eyes, then took a quick small breath and opened her mouth to speak.\n\n'Alex... why did you hurt Auntie Jane?' My heart sunk at those words she had uttered so innocently to me. I froze up and felt my body begin to sweat profoundly as the rate of my heart beat climbed steadily. I swallowed hard and took a deep breath before attempting to respond to her.\n\n'Wh-what makes you think that Rebecca?' I asked her as my shaking voice broke the silence.\n\n'Auntie Jane told me so.' My jaw dropped. 'She's sitting right there,' she announced somberly as she pointed to the seat opposite of her.\n\nI made her promise me that she wouldn't tell a soul about the truth of my mother's death. That little girl could ruin my entire life with just one sentence, 'Alex killed Auntie Jane', and that more than anything, terrifies me to the very core of my existence. One day...\n\n...I may just have to kill her too."
    },
    {
        "name":"Jaundice",
        "category":"Paranormal",
        "number":"Johnny was a kid in third grade, as were most children his age. One particular summer afternoon, after getting off the bus and walking down the street toward his house, he stopped to talk to his neighbor who was standing in his yard. After a brief conversation, he went home, so as not to worry his mother.\n\n'And just where have you been?' his mother asked as he walked in the front door.\n\n'Talking to the guy next door,' he said as he set his backpack on a chair at the kitchen table and sat across from his mother. “What’s jaundice mean?” he asked.\n\n'What?' queried his mother, confused as to how he had learned that word. 'Where did you hear that?' she asked.\n\n'I was coming down the street and saw the man next door. I asked him why his skin was so yellow!' Johnny stated, proudly.\n\n'Oh. I see,' his mother said, 'Go to your room, and do your homework.' She walked to the window and looked over to the house next door. She didn’t want to remind her son that their neighbor had died a week ago, from liver failure."
    },
    {
        "name":"The Lost Soul",
        "category":"Paranormal",
        "number":"My name is Joel and my life has been changed forever. Two weeks ago, my girlfriend Sophia was murdered down the street from my house. I was shocked the next day, when I found her body as I walked to school. She was stabbed in the stomach three times, and left to bleed to death on the sidewalk./n/nI couldn't believe what I was staring at. Who would brutally murder a 14-year old girl that had done nothing wrong in her entire life? I called 911 and the rest of the day was just a depressed, blurry haze. I can't remember much else happening, besides me breaking down and crying at the police station when they interrogated me.\n\nThe next day, and the days afterwards, I skipped school and two days after I found her body. I was watching TV. I don't remember what show I was watching, but I thought I heard Sophia's voice calling my name. I searched for the source, never finding it and realizing that I couldn't have heard her voice, because she was dead.\n\nAs I walked back to the couch, I heard the voice again, and this time I thought I saw a transparent image of Sophia. She was saying, 'Come with me, Joel.'\n\nI was surprised at first, realizing that Sophia was now following me as a spirit, but it also comforted me. After I first saw her as a ghost, I started seeing the apparition more often. I usually saw her walking next to me as I walked to and from school.\n\nYesterday, I saw her again, and this time she was pointing towards a spot on the sidewalk and saying, 'Stay away from him, he will hurt you, Joel.'\n\nI didn't know what she meant by this, so I continued walking home. This morning, as I walked past the spot that I found her corpse, a dark, hooded figure approached me. In his hand, I saw something shiny; a knife. At this, I remembered what Sophia had said. He ran towards me and stabbed me once in the stomach.\n\nKnocking me to the ground, he laughed and said the one thing I didn't expect to hear:\n\n'Wow, that girl put up more of a fight than you. You're pathetic!'\n\nIt took awhile to register what he had said, then everything made sense to me; this man had killed Sophia, and now was trying to kill me.\n\nI replied in a pain-filled voice, 'Y-you killed her?'\n\nI spat in his face and pulled out my own knife, as I remembered I had it.\n\nHe wiped his face and grinned and said, 'Yeah, so what? She was only a teenager...'\n\nI didn't let him finish, I ran at him, knocking his knife free from his hand. He recovered a lot faster than I originally expected and he stabbed me again several more times. He was standing over me, when he said:\n\n'You little twit, did you really think that you would win that fight?'\n\nI didn't answer, the pain was too intense, but as my vision clouded over, I saw Sophia's ghostly form appear next to me and say in her calm, childlike voice:\n\n'Welcome home, Joel, I missed you so much.' I smiled, as my life's story came to an end."
    },
    {
        "name":"Bed of Sorrow",
        "category":"Paranormal",
        "number":"The Bed of Sorrow is a legend born from many ancient ghost stories and folktales that have, over time, become merged into the story we know today: it is practiced in small numbers by those who either believe in its supposed power or who simply seek a thrill in the manner of other haunted games such as Bloody Mary.\n\nThe legend states that the Bed of Sorrow was used by a poor soul long since departed who would weep day and night into the sheets, unable to be consoled as they withered away in that bed—never leaving, not even to eat, drink, or relieve themselves.\n\nIn time the inevitable occurred and the tragic figure died, still weeping—although they were removed from the bed and given a burial, the bed itself would begin to exhibit unnatural properties such as the once white sheets turning a shade of red.\n\nA feeling of continual dread surrounded the bed and thus, if the story is to be believed, it was destroyed in an effort to end what many believed was a curse left behind by a restless spirit.\n\nAs with such stories however, the bed is said to somehow materialize even to this day, and those who seek it out are said to find any abandoned house and search for a single room with a red door that appears locked.\n\nKnocking on the door twice opens it and the explorer may enter, upon doing so they will notice the room is completely empty with no furniture or windows—the only object to be found is a single bed in the middle of the room with red sheets.\n\nThis is when the explorer has a choice to leave the room and never return, as many do, yet if one dares to proceed they may close the red door behind them and make their way to the bed and lay down on it, making sure to lay on top of the sheets.\n\nAs they lay on the bed, they must close their eyes and remain deadly still, the sound of weeping will fill the room and the sound of knocking will come from the red door. One must keep still and never open their eyes, no matter how loud the weeping gets or how violent the knocking becomes.\n\nThe bed will seem to shake, but once again, one must not open their eyes nor move, eventually the shaking will stop and the room will go silent—at this point a voice will whisper from the dark:\n\n'It is done.'\n\nAt that moment one must open one's eyes and leave the room—being sure to close the door behind them and not look back, one must continue to exit the house and head back home without looking back or talking to anyone or anything on the journey back.\n\nShould a figure in red appear at any point during one's journey home, run and do not stop. Should a figure in white appear, however, keep walking and under no circumstances begin to run.\n\nShould one make it home, immediately go to bed and sleep—when one awakens all feelings of doubt and grief will vanish, the story claims the Bed of Sorrow shall take away one's troubles for up to seven days following the encounter but should any of the steps be missed or broken, the weight of one's grief and doubt will increase tenfold every day until one can successfully complete the tasks."
    },
    {
        "name":"Aiden",
        "category":"Paranormal",
        "number":"This all happened in late August 2008. My older cousins (who are both eighteen years of age now) Angel and AJ were all playing with one of those Ouija Boards with me. Being only nine years old at the time, I didn't think that anything bad was going to happen at all. And, of course, being fourteen year-old teenagers, you always wanted to have fun and do anything that's 'out of the ordinary' before you grow older.\n\nAnyways, we were all at my house - which was a two-story, white brick home, and Angel had already set up the Ouija Board on top of the table which was in the bottom floor of the house. As him and AJ were setting things up downstairs I was upstairs, watching horror movies like I always did. Just as the movie was about to reach the turning point, my cousins had called me downstairs. At first I had no idea what they were planning on doing, and my curiosity got the best of me, so I quickly made my way out my older brother's room.\n\n'Hey Alice get down here - we have a surprise for you!' AJ shouted out as I stumbled on the staircase. I held onto the railings and carefully walked down the stairs. As I finally reached the floor, Angel took my hand and told me to grab a chair and join him and AJ.\n\n'What're you guys doing?' I asked quickly. Angel and AJ looked at each other and giggled. I immediately thought that they were going to pull a fast one on me, so I just stood there, watching them laugh uncontrollably. 'I said... What are you two doing?' My anger began to pour over me as they continued laughing.\n\nFinally, Angel inhaled a great amount of air, and replied by saying, 'Y'know how you like paranormal stuff?' My fury melted away, and was soon replaced by great excitement.\n\n'Yes!' I shouted out happily. AJ then stood next to Angel, and said, 'Weeeeell... Would you be interested in joining us in our little 'chat' with the undead?' He added air quotes as he said that. I couldn't exactly speak, for I was really shocked, so instead, I gave a little nod of the head, and sat down at the table.\n\nI then noticed a board, with various letters and numbers, and a text that said 'GOOD-BYE' on the bottom part of the board, and the words 'YES' and 'NO' at the top corners of it. Angel and AJ then sat around the table. I noticed a triangular shaped object in the middle of the board. I looked confusingly at Angel, then to AJ. 'What's that?' I said, indicating to the object. They ignored my question and simply told me to place my fingers on it.\n\nJust as I was about to ask what I had to do, AJ said in a loud voice, 'WHO ARE YOU?' A few moments passed, and AJ repeated his question, in a more booming voice. Seconds passed, then minutes. I was growing annoyed, until the triangular object began to move by itself. I panicked a bit, but then slowly calmed down. It slowly moved to the letter 'A' and then to 'I'... about a minute later, Angel had written down the letters.\n\n'I guess this ghost's a HE... His name's Aiden,' Angel said, holding up a piece of paper that legibly said: 'AIDEN' in all caps. AJ then asked another question: 'HOW OLD ARE YOU?' Once again, the object began to move again slowly towards the numbers this time. It was placed on the '1' and the '5'.\n\n'ARE YOU FIFTEEN YEARS OLD, AIDEN?' By now I was starting to get scared. A chill went up my spine as the triangle began moving again. It carefully landed on 'YES'. Things started escalating from that point. Aiden had hung himself due to the amount of depression he was going through. Apparently he had died in 2000; a few years before my family moved here. When Angel told the spirit to show himself, a glass vase that was behind AJ fell off the dresser, and shattered into a million pieces. AJ flipped out and yelled at Angel.\n\nMy two cousins began telling each other off in front of me. I watched them two argue with each other. I was going to tell them to stop, but I saw a huge shadow from the corner of my eye. I turned around quickly, only to see that there was nothing but the front door. I looked back at my cousins, who silenced completely. They were both staring above me. Normally, a person would be too scared to look behind them. I, however, looked back and saw the large mass of darkness, hovering behind me.\n\nI screamed in terror, as the mass began to progress its way towards me. A lightning bolt of intense cold struck me, and I sat there, shivering uncontrollably. 'LEAVE HER ALONE, AIDEN!' Angel shouted out angrily, as he lifted me up from the floor and held me in his arms. Some picture frames that hung on the wall fell as soon as Angel finished his sentence. I glanced at AJ, whose skin was drained of all color. His eyes were wide with fear. He gulped, then shouted out, 'STAY AWAY FROM ALICE, AIDEN!'\n\nIn a low growl, I clearly heard Aiden say, 'I WANT THE GIRL!' By this time, I was panic-stricken. I closed my eyes tightly, and felt ice cold air on my face. 'GIVE ME THE GIRL!' I heard the low demonic voice shout out again. I screamed again in fright. I heard Angel's voice yell out, 'GO AWAY, AIDEN! LEAVE US ALONE!'\n\nAnother low growl was heard, I didn't understand it at first, but then Aiden said, 'I'LL SEE YOU ALL SOON... OH, VERY SOON.' And the black mass disappeared quickly. The cold air then left the entire room. Angel and AJ stood there, their feet rooted to the floor. This is insane! I thought to myself. What if he really DOES come back?\n\nDays passed, then turned to weeks, then to months... And finally to years. I haven't seen Aiden for three whole years... It was on December 21, 2012, that I finally saw him again. He wasn't as aggressive as he was before. My cousins are still afraid of Aiden... He doesn't mean any harm to any of us. We get along really great, actually. He talks to me when I'm sad... He calms me down when I'm angry... He's a real good friend... He's here with me right at this moment actually..."
    },
    {
        "name":"Blind Confusion",
        "category":"Paranormal",
        "number":" was in my bedroom, as usual, just sitting there on my old dirty bed until I felt a disturbance within myself. It started with curiosity and then ended with fear and worry. The strange sensation lasted for about roughly ten minutes, until I decided to get out of bed and reassure myself that there was nothing to be worried about. I searched my entire house, the dirty old bathroom and its untidy drawers.\n\nMy clean kitchen and the nice and tidy cupboards, the kitchen is the only thing I kept clean due to my passion for cooking. I've always enjoyed cooking, ever since my mother first taught me when I was a child. I still remember it to this day, she showed me how to cook spaghetti and how to make home-made Bologna sauce. Ever since that day I began to experiment with food and try and come up with new recipes. Anyway, I digress.\n\nAs I finished searching through my house, in every nook and cranny, I decided that I would be a good idea to go back to bed. My wife was fast asleep... she always get lots of sleep. I checked the time, 6:00am. Great... another late night. This routine of, feeling strange and searching my house has been going on for almost four weeks now... I don't know what started it... Something just doesn't seem right... as if there's something here... I hope it gets better; I haven't slept in weeks...\n\nThat next day I got out of bed. And went out, I would've gotten ready, but I didn't though; What's the point anymore? No-one's gonna notice.\n\nAs I walked out of my front door, I began to walk down the street. I looked around and saw the battered rotten old houses, boarded up doors, and windows and I began to remember my friends who used to live there.\n\nIt's been a long time... What year is it anymore? I said to myself.\n\nI've really lost it recently. I can't even remember what year it is...\n\nAfter a day of strolling through the streets and thinking of memories past I decided to go back home. I went into my filthy old house and planked myself onto the couch. I looked across and saw my wife sitting there sobbing. She's been this way ever since I woke up about four weeks ago with that strange sensation I spoke about. We've never spoken since. She sometimes stares at me, sighs, and then looks away...\n\nLater that night as I restlessly paced around my old bedroom, I had that strange feeling as per usual, and I began to search my house to reassure myself, like I usually do. Until I found it... the thing that was making me the way I feel the way I do every night... It was my uncle standing there looking at me with happiness.\n\nI uttered, 'U-uncle... You've been... D-dead for years...'\n\nHe looked at me with astonishment and said; 'I could say the same to you!'"
    }
]